package lesson01.online.homework;

public class BooleanCheck {
    public static void main(String[] args){
        int a = 16;
        int b = 5;

        if ((((a + b) <= 20)) && ((a + b) >= 10)) {
            System.out.println("True");
        } else {
            System.out.println("False");
        }



//        public static int result(int valueA, int valueB){
//        return valueA + valueB;
//        }

    }
}
//            public static boolean trueFalse (int checkValue) {
//                if (20 >= checkValue() && checkValue() => 10);
//            }

/*
2) Написать метод, принимающий на вход два целых числа,
и проверяющий что их сумма лежит в пределах от 10 до 20(включительно),
если да – вернуть true, в противном случае – false;

 */